# MaterialParamColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialParamColor Property
ParameterTypeId Class See Also
---
"Color"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialParamColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialParamColor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialParamColor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace